     C                   CLEAR                   DEPT              3
     C                   CALL      'EMPBYDEPT'
     C                   PARM                    DEPT
     C                   seton                                        lr
